cf_billing/Enums/энргТипыСтроений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргТипыСтроений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖД_БлокЗастройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОСЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОБЩ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гараж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьэнргПерерасчет_КорректировкаПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_ВосстановлениеИзЗабалансаФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_СписаниеНаЗабалансФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ИзменениеКатегорииЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ОтменаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_РегистрацияЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_РегистрацияПоСтроению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ЗакрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ОткрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_СменаСобственника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ОтключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ПодключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Закрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Открытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ВозвратСредствПотребителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_НеправильноРаспределеннаяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ПереносМеждуЛицевымиСчетами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_БлокировочныйАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаПотребленногоОбъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_СвязанныеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Извещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РешениеСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ЗакрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОтключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОткрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ПодключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПерерасчетНенадлежащегоКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПереносВозвратОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_МассовоеСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОграничениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ВозобновлениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Вмешательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РаспределениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_ПериодОтсутствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonForms/энргФормаВыбораТипаСтроения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Коллекция  = Метаданные.Перечисления.энргТипыСтроений.ЗначенияПеречисления;
	Для Каждого Значение Из Коллекция Цикл		
		ТипыСтроений.Добавить(Перечисления.энргТипыСтроений[Значение.Имя],Значение.Синоним);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипыСтроенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранноеЗначение 					= ТипыСтроений.Получить(ВыбраннаяСтрока);
	Если ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД") 
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОБЩ") Тогда
		ВыбранноеЗначение 				= ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОткрытиеМКД_Открытие");
		ИмяДокумента 					= "энргОткрытиеМКД";
		ПрефиксФормы 					= энргРаботаСВидамиОперацийВызовСервера.ПрефиксФормы(ИмяДокумента,ВыбранноеЗначение);
		энргРаботаСВидамиОперацийКлиент.ОткрытьФормуНовогоДокументаПоВидуОперации(ИмяДокумента,ВыбранноеЗначение,ПрефиксФормы,Новый Структура);
		ЭтаФорма.Закрыть();
	ИначеЕсли ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЖД")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЖД_БлокЗастройки")
		или ВыбранноеЗначение.Значение=ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОСЗ")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ЗУ")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.Гараж")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ХБ")
		Или ВыбранноеЗначение.Значение = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.СД") Тогда
		ДанныеЗаполнения 				= Новый Структура();
		ДанныеЗаполнения.Вставить("ТипСтроения",ВыбранноеЗначение.Значение); 
		ОткрытьФорму("Справочник.энргСтроения.ФормаОбъекта",Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения),ЭтаФорма.ВладелецФормы,,,,, РежимОткрытияОкнаФормы.Независимый);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьСоздание(Команда)
	// Вставить содержимое обработчика.
		ТипыСтроенийВыбор(Элементы.ТипыСтроений, ТекущийЭлемент.ТекущаяСтрока, Элементы.ТипыСтроений.ТекущийЭлемент, Истина);

КонецПроцедуры

#КонецОбласти
